// Службы раскрытия
enum class Department(val statName: String, val shortName: String) {
    VKP("ПРАЦ.КР", "ВКП"),
    VPD("ДIЛЬНИЧИЙ ОФІЦЕР ПОЛІЦІЇ", "ВПД"),
    UPPD("ПРАЦ.ПРЕВЕНТ. ДІЯЛЬНОСТІ З ЮВЕН. ПРЕВЕНЦІЇ", "ЮППД"),
    SV("СЛІДЧИЙ НАЦІОНАЛЬНОЇ ПОЛІЦІЇ", "СВ"),
    UPN("ПРАЦ. ПРОТИДІЙ НАРКОЗЛОЧИННОСТІ", "УПН"),
    VVB("ПРАЦ.ВБ", "ВВБ"),
    UZE("ПРАЦ.ДЕПАРТ. ЗАХИЧТУ ЕКОНОМІКИ (ДЗЕ)", "УЗЕ"),
    UKP("ПРАЦ.ПIДРОЗ. КІБЕРПОЛІЦІЇ", "Кіберполіція"),
    VBTL("ПРАЦ.ПIДРОЗД.БОР.ЗI ЗЛОЧ.ПОВЯЗАН.З ТОРГ.ЛЮДЬМИ", "ВБЗПТЛ"),
    SBU("ПРАЦ.СБУ", "СБУ"),
    PP("ПАТРУЛЬНОЇ ПОЛІЦІЇ", "Патрульна"),
    USR("ПРАЦ. КРИМІНАЛЬНОЇ ПОЛІЦІЇ ПІДРОЗДІЛІВ СТРАТЕГІЧНИХ РОЗСЛІДУВАНЬ", "УСР")

}

val DEPART_GUNP = setOf<String>("УПН", "ВВБ", "УЗЕ", "Кіберполіція", "ВБЗПТЛ", "СБУ", "Патрульна", "УСР")

fun getCodeDepart(strDepart: String) =
    when(strDepart) {
        "ДIЛЬНИЧИЙ ОФІЦЕР ПОЛІЦІЇ", "ВПД" -> Department.VPD
        "ПРАЦ.КР", "ВКП" -> Department.VKP
        "ПРАЦ.ПРЕВЕНТ. ДІЯЛЬНОСТІ З ЮВЕН. ПРЕВЕНЦІЇ", "ЮППД" -> Department.UPPD
        "СЛІДЧИЙ НАЦІОНАЛЬНОЇ ПОЛІЦІЇ", "СВ" -> Department.SV
        "ПРАЦ. ПРОТИДІЙ НАРКОЗЛОЧИННОСТІ", "УПН" -> Department.UPN
        "ПРАЦ.ВБ", "ВВБ" -> Department.VVB
        "ПРАЦ.ДЕПАРТ. ЗАХИЧТУ ЕКОНОМІКИ (ДЗЕ)", "УЗЕ" -> Department.UZE
        "ПРАЦ.ПIДРОЗ. КІБЕРПОЛІЦІЇ", "Кіберполіція" -> Department.UKP
        "ПРАЦ.ПIДРОЗД.БОР.ЗI ЗЛОЧ.ПОВЯЗАН.З ТОРГ.ЛЮДЬМИ", "ВБЗПТЛ" -> Department.VBTL
        "ПРАЦ.СБУ", "СБУ" -> Department.SBU
        "ПАТРУЛЬНОЇ ПОЛІЦІЇ", "Патрульна" -> Department.PP
        "ПРАЦ. КРИМІНАЛЬНОЇ ПОЛІЦІЇ ПІДРОЗДІЛІВ СТРАТЕГІЧНИХ РОЗСЛІДУВАНЬ", "УСР" -> Department.USR
        else -> throw IndexOutOfBoundsException("Невірна назва служби: $strDepart")
    }
