// Службы раскрытия
enum class Department(val statName: String, val shortName: String) {
    VKP("ПРАЦ.КР", "ВКП"),
    VPD("ДIЛЬНИЧИЙ ОФІЦЕР ПОЛІЦІЇ", "ВПД"),
    UPPD("ПРАЦ.ПРЕВЕНТ. ДІЯЛЬНОСТІ З ЮВЕН. ПРЕВЕНЦІЇ", "ЮППД"),
    SV("СЛІДЧИЙ НАЦІОНАЛЬНОЇ ПОЛІЦІЇ", "СВ"),
    UPN("ПРАЦ. ПРОТИДІЙ НАРКОЗЛОЧИННОСТІ", "УПН"),
    VVB("ПРАЦ.ВБ", "ВВБ"),
    UZE("ПРАЦ.ДЕПАРТ. ЗАХИЧТУ ЕКОНОМІКИ (ДЗЕ)", "УЗЕ"),
    UKP("ПРАЦ.ПIДРОЗ. КІБЕРПОЛІЦІЇ", "УКП"),
    VBTL("ПРАЦ.ПIДРОЗД.БОР.ЗI ЗЛОЧ.ПОВЯЗАН.З ТОРГ.ЛЮДЬМИ", "ВБЗПТЛ")

}

val DEPART_GUNP = setOf<String>("УПН", "ВВБ", "УЗЕ", "УКП", "ВБЗПТЛ")

fun getCodeDepart(strDepart: String) =
    when(strDepart) {
        "ДIЛЬНИЧИЙ ОФІЦЕР ПОЛІЦІЇ", "ВПД" -> Department.VPD
        "ПРАЦ.КР", "ВКП" -> Department.VKP
        "ПРАЦ.ПРЕВЕНТ. ДІЯЛЬНОСТІ З ЮВЕН. ПРЕВЕНЦІЇ", "ЮППД" -> Department.UPPD
        "СЛІДЧИЙ НАЦІОНАЛЬНОЇ ПОЛІЦІЇ", "СВ" -> Department.SV
        "ПРАЦ. ПРОТИДІЙ НАРКОЗЛОЧИННОСТІ", "УПН" -> Department.UPN
        "ПРАЦ.ВБ", "ВВБ" -> Department.VVB
        "ПРАЦ.ДЕПАРТ. ЗАХИЧТУ ЕКОНОМІКИ (ДЗЕ)", "УЗЕ" -> Department.UZE
        "ПРАЦ.ПIДРОЗ. КІБЕРПОЛІЦІЇ", "УКП" -> Department.UKP
        "ПРАЦ.ПIДРОЗД.БОР.ЗI ЗЛОЧ.ПОВЯЗАН.З ТОРГ.ЛЮДЬМИ", "ВБЗПТЛ" -> Department.VBTL
        else -> throw IndexOutOfBoundsException("Невірна назва служби: $strDepart")
    }
